{
  "_WARNING": "IMPORTANT: The contents of this file are auto-generated. Manual changes will be overwritten when the generator runs.",
  "title": "Funastics",
  "description": "Funastics was a place where kids built skills, confidence, and character while having fun. With strong branding and smart systems, it grew into a trusted community hub that felt bigger than a single location.",
  "technologies": [
    "Owner",
    "Instructor",
    "Gymnastics",
    "Life Skills"
  ],
  "tags": [
    "Owner",
    "Instructor",
    "Gymnastics",
    "Life Skills"
  ],
  "category": "Mentor",
  "status": "Retired",
  "featured": false,
  "publishDate": "2006-06-01",
  "contentTitle": "Champions For Life",
  "achievementTitle": "Key Takeaways",
  "readTime": "5 min read",
  "excerpt": "Funastics was a place where kids built skills, confidence, and character while having fun. With strong branding and smart systems, it grew into a trusted community hub that felt bigger than a single location.",
  "links": {
    "demo": ""
  },
  "content": {
    "overview": "\r\\n<!-- PROJECT CONTENT - Markdown body text -->\r\\n\r\\n## The Journey  \r\\n\r\\nI’ve always been the kid flipping front and back handsprings down school hallways during class – and somehow never getting in trouble. I even did breakdancing moves before it was cool. In college, I joined the Yell Leaders and performed flips in front of a packed stadium for the thrill of it. After that, I taught gymnastics in my brother’s Taekwondo studio for a few years. I loved it, and when I moved to Arizona I knew it was time to start my own gym. That’s how **Funastics** was born – a place where learning gymnastics was about more than flips. It was about building confidence, strength, and life skills, all while having&nbsp;fun.\r\\n\r\\n## Our Philosophy  \r\\n\r\\nFunastics was built around one simple idea: **progress at your own pace in a supportive, fun environment**. No stress, no competitive team. Every student could succeed by taking the next step that was right for them. We borrowed from martial arts the concepts of earned rank and respect, then reimagined it for kids&nbsp;gymnastics.  \r\\n\r\\nEvery child tracked their growth on an **individual progress chart** that included flexibility, strength, and skill goals. Skills were separated into levels and had to be passed off one-on-one with an instructor before moving on. This gave kids structure and safety while helping them see real progress. Each time they advanced, they earned a colored star for the sleeve of their Funastics shirt. Earning that next star wasn’t just about tumbling — it was about persistence, self-control, and believing they could&nbsp;do&nbsp;it.  \r\\n\r\\nAt the top of the program sat the **Gold Star students**, who could join the **Junior Instructor track**. This wasn’t just a title; it was available leadership training. Older kids learned how to demonstarate and guide younger ones from experience, safely spot skills, and learn to truely mentor. They wore their stars proudly, knowing they had earned them through commitment and consistency. The whole program came to be known as the **Funastics Star Program** — a system that blended gymnastics skills with character-building.  \r\\n\r\\n### We also taught four simple values that every student could understand:  \r\\n\r\\n- **Courage** – the bravery to try something new.  \r\\n- **Commitment** – the drive to keep practicing.  \r\\n- **Control** – learning to focus body and mind.  \r\\n- **Confidence** – the self-belief that grows with each&nbsp;success.  \r\\n\r\\nThese were reinforced in our daily **life-skill huddles**. After each activity rotation, we pulled together for a short motivational talk — sometimes about effort, sometimes about teamwork, sometimes about bouncing back after a fall. Kids shouted affirmations back as a group: “Who controls your body? I do!” “Who decides you are good? I do!” Those chants stuck. Parents often told me their kids used them at home before school tests or sports&nbsp;games.\r\\n\r\\n## Curriculum & Class Structure  \r\\n\r\\nThe curriculum was built for **energy and variety**. Every 10 minutes, we switched to a new activity so kids stayed engaged. A class might start with a fast-paced game, move to balance drills, shift into one-on-one skill practice, and then finish with a group challenge. The rhythm kept things moving and gave every student a chance to&nbsp;shine.  \r\\n\r\\nThe one-on-one stations were where progress happened. An instructor spotted each child on their skill, signed off when it was safe, and updated their progress chart. That structure meant no one skipped ahead too fast and every star was earned. Group activities, on the other hand, built teamwork and camaraderie. Kids cheered for each other, shared tips, and learned patience as they waited their&nbsp;turn.  \r\\n\r\\n> The balance of **personal coaching and group energy** made the program feel both supportive and exciting. No one was left sitting on the sidelines, and every child left feeling like they’d accomplished something&nbsp;new.\r\\n\r\\n## Strength in Body and Mind  \r\\n\r\\nFunastics was about getting stronger in all ways. Physically, kids built the flexibility to stretch further, the strength to hold handstands, and the control to master each move safely. Mentally, they built resilience. When a child stumbled on a skill, the focus was always on what they *could* do — and on trying again. Over time, even shy or hesitant kids learned to push past fear and surprise&nbsp;themselves.  \r\\n\r\\nWe saw courage grow every day. A child who once said, “I can’t do it” would eventually say, “Watch me.” Each new star badge wasn’t just fabric on a sleeve; it was proof of their effort and progress. It gave them something they could point to and be proud of. That visible recognition mattered — it told them their hard work&nbsp;counted.  \r\\n\r\\nParents often commented that they saw changes at home: kids more willing to take on chores, schoolwork, or even speaking up in class. The confidence they built inside the gym carried into the rest of their&nbsp;lives.\r\\n\r\\n## The Funastics Gym  \r\\n\r\\nOur physical space was designed for energy and community. The strip-mall unit was gutted and rebuilt with padded flooring, mirrors, and bright paint. Modular equipment could be moved and reset daily to fit the class plan. Around the mats, we placed chairs so families could watch, cheer, and even join in games. On the windows, our logo, phone number, website, and a tray of free trial coupons made it easy for anyone walking by to step&nbsp;inside.  \r\\n\r\\nWe created an environment where families felt part of the action. Some nights we held **special events** — open gyms where kids could explore freely, movie and pizza nights with public demonstrations where students proudly performed for their parents and friends. Even air powered Bounce Gyms for the toddlers. We offered branded gym gear, and car window decals so students could display Funastics brand outside the gym, too. All of it added to the sense that this wasn’t just a class — it was a&nbsp;community.\r\\n\r\\n## Digital and Local Outreach  \r\\n\r\\nAt the time, our website stood out. It was built in Flash, full of animated images, dynamic content, music from the gym, and even hidden arcade games (which parents loved as much as the kids). Parents could sign up and pay bills online, a feature that impressed families in those early days of e-commerce. With just a $50/month ad budget, I had Funastics.com ranking above local franchises in a matter of&nbsp;months.  \r\\n\r\\nOffline, I worked the neighborhoods and some schools. Every month I delivered laminated trial coupons, mini-flyer business cards, and postcards. Families called, referrals grew, and soon the classes were filling up. After 1 year I was in the black. The polished branding left many people convinced Funastics was a franchise, not a single-location.\r\\n\r\\n## Reflection and Moving Forward  \r\\n\r\\nFor three years, Funastics ran at full speed, with 50–80 students a day tumbling, laughing, and growing in confidence. I hired some wonderful instructors, worked with supportive families, and watched kids transform before my eyes. Some families drove an hour each way just to be part of&nbsp;it.  \r\\n\r\\nWhen the 2008 real estate crash hit, many of our families were impacted. Enrollment dropped, and I eventually sold the gym location in 2009. But the lessons — for the kids and for me — lasted far&nbsp;longer.  \r\\n\r\\nWhat Funastics taught me is that kids thrive when you give them structure, positivity, and belief in themselves. They don’t just learn skills — they learn who they are. They learn to set goals, push through setbacks, and celebrate progress. I’ll never forget the look on a child’s face when they earned that next star or stuck their first back handspring. That spark of confidence is what Funastics was always&nbsp;about.  \r\\n\r\\n**Help someone believe in themselves, and they’ll find a way&nbsp;to&nbsp;fly.**\r\\n",
    "overviewHtml": "<!-- PROJECT CONTENT - Markdown body text -->\n\n<h2 id=\"the-journey\" class=\"project-section-title\">The Journey</h2><p class=\"project-content-paragraph\">I’ve always been the kid flipping front and back handsprings down school hallways during class – and somehow never getting in trouble. I even did breakdancing moves before it was cool. In college, I joined the Yell Leaders and performed flips in front of a packed stadium for the thrill of it. After that, I taught gymnastics in my brother’s Taekwondo studio for a few years. I loved it, and when I moved to Arizona I knew it was time to start my own gym. That’s how <strong>Funastics</strong> was born – a place where learning gymnastics was about more than flips. It was about building confidence, strength, and life skills, all while having&nbsp;fun.</p>\n<h2 id=\"our-philosophy\" class=\"project-section-title\">Our Philosophy</h2><p class=\"project-content-paragraph\">Funastics was built around one simple idea: <strong>progress at your own pace in a supportive, fun environment</strong>. No stress, no competitive team. Every student could succeed by taking the next step that was right for them. We borrowed from martial arts the concepts of earned rank and respect, then reimagined it for kids&nbsp;gymnastics.  </p>\n<p class=\"project-content-paragraph\">Every child tracked their growth on an <strong>individual progress chart</strong> that included flexibility, strength, and skill goals. Skills were separated into levels and had to be passed off one-on-one with an instructor before moving on. This gave kids structure and safety while helping them see real progress. Each time they advanced, they earned a colored star for the sleeve of their Funastics shirt. Earning that next star wasn’t just about tumbling — it was about persistence, self-control, and believing they could&nbsp;do&nbsp;it.  </p>\n<p class=\"project-content-paragraph\">At the top of the program sat the <strong>Gold Star students</strong>, who could join the <strong>Junior Instructor track</strong>. This wasn’t just a title; it was available leadership training. Older kids learned how to demonstarate and guide younger ones from experience, safely spot skills, and learn to truely mentor. They wore their stars proudly, knowing they had earned them through commitment and consistency. The whole program came to be known as the <strong>Funastics Star Program</strong> — a system that blended gymnastics skills with character-building.  </p>\n<h3 id=\"we-also-taught-four-simple-values-that-every-student-could-understand\" class=\"project-subsection-title\">We also taught four simple values that every student could understand:</h3><ul class=\"project-content-list\">\n<li><strong>Courage</strong> – the bravery to try something new.  </li>\n<li><strong>Commitment</strong> – the drive to keep practicing.  </li>\n<li><strong>Control</strong> – learning to focus body and mind.  </li>\n<li><strong>Confidence</strong> – the self-belief that grows with each&nbsp;success.</li>\n</ul>\n<p class=\"project-content-paragraph\">These were reinforced in our daily <strong>life-skill huddles</strong>. After each activity rotation, we pulled together for a short motivational talk — sometimes about effort, sometimes about teamwork, sometimes about bouncing back after a fall. Kids shouted affirmations back as a group: “Who controls your body? I do!” “Who decides you are good? I do!” Those chants stuck. Parents often told me their kids used them at home before school tests or sports&nbsp;games.</p>\n<h2 id=\"curriculum-class-structure\" class=\"project-section-title\">Curriculum & Class Structure</h2><p class=\"project-content-paragraph\">The curriculum was built for <strong>energy and variety</strong>. Every 10 minutes, we switched to a new activity so kids stayed engaged. A class might start with a fast-paced game, move to balance drills, shift into one-on-one skill practice, and then finish with a group challenge. The rhythm kept things moving and gave every student a chance to&nbsp;shine.  </p>\n<p class=\"project-content-paragraph\">The one-on-one stations were where progress happened. An instructor spotted each child on their skill, signed off when it was safe, and updated their progress chart. That structure meant no one skipped ahead too fast and every star was earned. Group activities, on the other hand, built teamwork and camaraderie. Kids cheered for each other, shared tips, and learned patience as they waited their&nbsp;turn.  </p>\n<div class=\"project-callout-panel\"><blockquote class=\"project-quote\">\n<p class=\"project-content-paragraph\">The balance of <strong>personal coaching and group energy</strong> made the program feel both supportive and exciting. No one was left sitting on the sidelines, and every child left feeling like they’d accomplished something&nbsp;new.</p>\n</blockquote></div>\n<h2 id=\"strength-in-body-and-mind\" class=\"project-section-title\">Strength in Body and Mind</h2><p class=\"project-content-paragraph\">Funastics was about getting stronger in all ways. Physically, kids built the flexibility to stretch further, the strength to hold handstands, and the control to master each move safely. Mentally, they built resilience. When a child stumbled on a skill, the focus was always on what they <em>could</em> do — and on trying again. Over time, even shy or hesitant kids learned to push past fear and surprise&nbsp;themselves.  </p>\n<p class=\"project-content-paragraph\">We saw courage grow every day. A child who once said, “I can’t do it” would eventually say, “Watch me.” Each new star badge wasn’t just fabric on a sleeve; it was proof of their effort and progress. It gave them something they could point to and be proud of. That visible recognition mattered — it told them their hard work&nbsp;counted.  </p>\n<p class=\"project-content-paragraph\">Parents often commented that they saw changes at home: kids more willing to take on chores, schoolwork, or even speaking up in class. The confidence they built inside the gym carried into the rest of their&nbsp;lives.</p>\n<h2 id=\"the-funastics-gym\" class=\"project-section-title\">The Funastics Gym</h2><p class=\"project-content-paragraph\">Our physical space was designed for energy and community. The strip-mall unit was gutted and rebuilt with padded flooring, mirrors, and bright paint. Modular equipment could be moved and reset daily to fit the class plan. Around the mats, we placed chairs so families could watch, cheer, and even join in games. On the windows, our logo, phone number, website, and a tray of free trial coupons made it easy for anyone walking by to step&nbsp;inside.  </p>\n<p class=\"project-content-paragraph\">We created an environment where families felt part of the action. Some nights we held <strong>special events</strong> — open gyms where kids could explore freely, movie and pizza nights with public demonstrations where students proudly performed for their parents and friends. Even air powered Bounce Gyms for the toddlers. We offered branded gym gear, and car window decals so students could display Funastics brand outside the gym, too. All of it added to the sense that this wasn’t just a class — it was a&nbsp;community.</p>\n<h2 id=\"digital-and-local-outreach\" class=\"project-section-title\">Digital and Local Outreach</h2><p class=\"project-content-paragraph\">At the time, our website stood out. It was built in Flash, full of animated images, dynamic content, music from the gym, and even hidden arcade games (which parents loved as much as the kids). Parents could sign up and pay bills online, a feature that impressed families in those early days of e-commerce. With just a $50/month ad budget, I had Funastics.com ranking above local franchises in a matter of&nbsp;months.  </p>\n<p class=\"project-content-paragraph\">Offline, I worked the neighborhoods and some schools. Every month I delivered laminated trial coupons, mini-flyer business cards, and postcards. Families called, referrals grew, and soon the classes were filling up. After 1 year I was in the black. The polished branding left many people convinced Funastics was a franchise, not a single-location.</p>\n<h2 id=\"reflection-and-moving-forward\" class=\"project-section-title\">Reflection and Moving Forward</h2><p class=\"project-content-paragraph\">For three years, Funastics ran at full speed, with 50–80 students a day tumbling, laughing, and growing in confidence. I hired some wonderful instructors, worked with supportive families, and watched kids transform before my eyes. Some families drove an hour each way just to be part of&nbsp;it.  </p>\n<p class=\"project-content-paragraph\">When the 2008 real estate crash hit, many of our families were impacted. Enrollment dropped, and I eventually sold the gym location in 2009. But the lessons — for the kids and for me — lasted far&nbsp;longer.  </p>\n<p class=\"project-content-paragraph\">What Funastics taught me is that kids thrive when you give them structure, positivity, and belief in themselves. They don’t just learn skills — they learn who they are. They learn to set goals, push through setbacks, and celebrate progress. I’ll never forget the look on a child’s face when they earned that next star or stuck their first back handspring. That spark of confidence is what Funastics was always&nbsp;about.  </p>\n<p class=\"project-content-paragraph\"><strong>Help someone believe in themselves, and they’ll find a way&nbsp;to&nbsp;fly.</strong></p>\n",
    "keyAchievements": [
      {
        "type": "Impact",
        "icon": "💹",
        "title": "Building a Brand and a Community",
        "description": "I launched Funastics as a recreational gymnastics program that blended skill-building with life lessons, while also running it like a polished, professional brand. The gym became a place where kids gained confidence, learned leadership, and had a blast, while parents appreciated the quality curricullum and life lessons, strong branding, and online systems.",
        "metrics": [
          "50–80 students per day across multiple age groups for 3 years",
          "Life lessons, motivational huddles, and leadership training built into every class",
          "Junior Instructor program created to give advanced students real responsibility",
          "Website ranked above local franchise competitors in 4 months with only $50/mo ad spend",
          "Cutting edge dynamic Flash site included online signup, billing, music, videos, and hidden arcade games.",
          "Polished branding and marketing often led parents to believe Funastics was a franchise"
        ]
      }
    ],
    "media": {
      "items": [
        {
          "type": "image",
          "src": "1-funastics-photos.jpg",
          "title": "Gym"
        },
        {
          "type": "image",
          "src": "2-funastics-curriculum.jpg",
          "title": "Curriculum"
        },
        {
          "type": "image",
          "src": "3-funastics-web.jpg",
          "title": "Modern Dashboard Interface"
        },
        {
          "type": "Website",
          "src": "4-funastics-print.jpg",
          "title": "Marketing"
        }
      ]
    }
  }
}